src/Catalogs/узКонфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>узКонфигурации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолучатьИзмененияИзХранилища</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение1с</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогТранзитнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательТранзитнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяВТранзитнуюБазу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяВХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДляЗагрузкиИзмененийИзХранилща</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/узКонфигурации/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	ПроверитьРеквизиты(Отказ);
	Если Отказ Тогда
		Возврат;
	Конецесли;
КонецПроцедуры

Процедура ПроверитьРеквизиты(Отказ)
	МассивПроверяемыхРеквизитов = ПолучитьМассивПроверяемыхРеквизитов();
	Для каждого ИмяРеквизита из МассивПроверяемыхРеквизитов цикл
		ЗначениеРеквизита = ЭтотОбъект[ИмяРеквизита];
		Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка! не заполнен реквизит ["+ИмяРеквизита+"]";
			Сообщение.Поле = "Объект."+ИмяРеквизита;
			Сообщение.Сообщить();
			Отказ = Истина;
		Конецесли;
	Конеццикла;
КонецПроцедуры 

Функция ПолучитьМассивПроверяемыхРеквизитов() Экспорт 
	МассивПроверяемыхРеквизитов = Новый Массив();
	Если ПолучатьИзмененияИзХранилища Тогда
		МассивПроверяемыхРеквизитов.Добавить("Приложение1с");
		МассивПроверяемыхРеквизитов.Добавить("КаталогТранзитнойБазы");
		МассивПроверяемыхРеквизитов.Добавить("ПользовательТранзитнойБазы");
		МассивПроверяемыхРеквизитов.Добавить("ПарольПользователяВТранзитнуюБазу");
		
		МассивПроверяемыхРеквизитов.Добавить("КаталогХранилища");
		МассивПроверяемыхРеквизитов.Добавить("ПользовательХранилища");
		МассивПроверяемыхРеквизитов.Добавить("ПарольПользователяВХранилище");
		Если ПараметрыСеанса.узЭтоСервернаяБаза Тогда
			МассивПроверяемыхРеквизитов.Добавить("КаталогДляЗагрузкиИзмененийИзХранилща");				
		Конецесли;
	Конецесли;
	Возврат МассивПроверяемыхРеквизитов; 
КонецФункции
